Revit 2026 API

# PaperSizeSetErase Method

---

Removes a specified object from the set.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public virtual int Erase(
	PaperSize item
)
```
```vb
Public Overridable Function Erase (
	item As PaperSize
) As Integer
```
```cpp
public:
virtual int Erase(
	PaperSize^ item
)
```
```fsharp
abstract Erase :
        item : PaperSize -> int
override Erase :
        item : PaperSize -> int
```

#### Parameters

item PaperSize
    The item to be erased.

#### Return Value

Int32The number of items that were erased from the set.

#### Reference

PaperSizeSet Class

Autodesk.Revit.DB Namespace